<style lang="less" scoped>
.c4s{
    width:90%;
    height:80%;
   
    .item{
        width:22%;
        height:42%;
        float: left;
        position: relative;
    }
}
</style>
<template>
    <div class="c4s">
        <div v-for="(item,index) in nianItems" :key="idName[index]" class="item">
            <a1ss 
            v-if="a1sShow"
            class="c211" 
            :idName='idName[index]' 
            :scenics='item["name"]'
            :isActive ='isActive' 
            :barData='item["data"]' 
            ></a1ss>
        </div>
    </div>
</template>

<script>
import a1ss from '@/pages/home/showMore/smallComponent/a1ss.vue'
import showMoreData from '@/common/js/mixin/showMoreData.js'
import a1sJson from '@/pages/home/showMore/bigComponent/json/a1s.json'
  export default {
    name:'A1S',
    mixins: [showMoreData],
    props:{
        scenics:Array,
        isActive:Boolean,
        dateIndex:Number,
        updatePlace:String,
    },
    watch:{
        dateIndex:function(val){
            let _self = this;
            this.nianItems = a1sJson[this.updatePlace][this.dateChose[val].context];
            this.a1sShow = false;
            setTimeout(() =>{_self.a1sShow = true},0)
        },
        updatePlace:function(val){
            let _self = this;
            this.nianItems = a1sJson[val][this.dateChose[this.dateIndex].context];
            this.a1sShow = false;
            setTimeout(() =>{_self.a1sShow = true},0)
        }
    },
    data() {
      return {
          a1sShow:true,
           nianItems:[
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "643"
                    },
                    {
                        "date": "12/29",
                        "num": "116"
                    },
                    {
                        "date": "12/30",
                        "num": "326"
                    },
                    {
                        "date": "12/31",
                        "num": "873"
                    },
                    {
                        "date": "01/01",
                        "num": "440"
                    },
                    {
                        "date": "01/02",
                        "num": "910"
                    },
                    {
                        "date": "01/03",
                        "num": "310"
                    }
                ],
                "name": "飞霞山风景名胜区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "309"
                    },
                    {
                        "date": "12/29",
                        "num": "690"
                    },
                    {
                        "date": "12/30",
                        "num": "919"
                    },
                    {
                        "date": "12/31",
                        "num": "845"
                    },
                    {
                        "date": "01/01",
                        "num": "396"
                    },
                    {
                        "date": "01/02",
                        "num": "194"
                    },
                    {
                        "date": "01/03",
                        "num": "380"
                    }
                ],
                "name": "牛鱼嘴原始生态风景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "671"
                    },
                    {
                        "date": "12/29",
                        "num": "139"
                    },
                    {
                        "date": "12/30",
                        "num": "350"
                    },
                    {
                        "date": "12/31",
                        "num": "634"
                    },
                    {
                        "date": "01/01",
                        "num": "859"
                    },
                    {
                        "date": "01/02",
                        "num": "253"
                    },
                    {
                        "date": "01/03",
                        "num": "878"
                    }
                ],
                "name": "天子山瀑布风景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "902"
                    },
                    {
                        "date": "12/29",
                        "num": "159"
                    },
                    {
                        "date": "12/30",
                        "num": "226"
                    },
                    {
                        "date": "12/31",
                        "num": "319"
                    },
                    {
                        "date": "01/01",
                        "num": "751"
                    },
                    {
                        "date": "01/02",
                        "num": "117"
                    },
                    {
                        "date": "01/03",
                        "num": "247"
                    }
                ],
                "name": "白庙渔村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "377"
                    },
                    {
                        "date": "12/29",
                        "num": "751"
                    },
                    {
                        "date": "12/30",
                        "num": "127"
                    },
                    {
                        "date": "12/31",
                        "num": "203"
                    },
                    {
                        "date": "01/01",
                        "num": "234"
                    },
                    {
                        "date": "01/02",
                        "num": "323"
                    },
                    {
                        "date": "01/03",
                        "num": "193"
                    }
                ],
                "name": "飞来寺"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "885"
                    },
                    {
                        "date": "12/29",
                        "num": "651"
                    },
                    {
                        "date": "12/30",
                        "num": "537"
                    },
                    {
                        "date": "12/31",
                        "num": "133"
                    },
                    {
                        "date": "01/01",
                        "num": "165"
                    },
                    {
                        "date": "01/02",
                        "num": "240"
                    },
                    {
                        "date": "01/03",
                        "num": "856"
                    }
                ],
                "name": "美林湖及大家元摩天轮片区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "141"
                    },
                    {
                        "date": "12/29",
                        "num": "342"
                    },
                    {
                        "date": "12/30",
                        "num": "736"
                    },
                    {
                        "date": "12/31",
                        "num": "976"
                    },
                    {
                        "date": "01/01",
                        "num": "666"
                    },
                    {
                        "date": "01/02",
                        "num": "148"
                    },
                    {
                        "date": "01/03",
                        "num": "987"
                    }
                ],
                "name": "太和古洞旅游区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "765"
                    },
                    {
                        "date": "12/29",
                        "num": "169"
                    },
                    {
                        "date": "12/30",
                        "num": "843"
                    },
                    {
                        "date": "12/31",
                        "num": "299"
                    },
                    {
                        "date": "01/01",
                        "num": "514"
                    },
                    {
                        "date": "01/02",
                        "num": "634"
                    },
                    {
                        "date": "01/03",
                        "num": "143"
                    }
                ],
                "name": "笔架山度假区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "761"
                    },
                    {
                        "date": "12/29",
                        "num": "193"
                    },
                    {
                        "date": "12/30",
                        "num": "392"
                    },
                    {
                        "date": "12/31",
                        "num": "288"
                    },
                    {
                        "date": "01/01",
                        "num": "974"
                    },
                    {
                        "date": "01/02",
                        "num": "626"
                    },
                    {
                        "date": "01/03",
                        "num": "910"
                    }
                ],
                "name": "安庆村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "653"
                    },
                    {
                        "date": "12/29",
                        "num": "298"
                    },
                    {
                        "date": "12/30",
                        "num": "168"
                    },
                    {
                        "date": "12/31",
                        "num": "131"
                    },
                    {
                        "date": "01/01",
                        "num": "144"
                    },
                    {
                        "date": "01/02",
                        "num": "150"
                    },
                    {
                        "date": "01/03",
                        "num": "451"
                    }
                ],
                "name": "清泉湾生态旅游度假区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "696"
                    },
                    {
                        "date": "12/29",
                        "num": "585"
                    },
                    {
                        "date": "12/30",
                        "num": "451"
                    },
                    {
                        "date": "12/31",
                        "num": "197"
                    },
                    {
                        "date": "01/01",
                        "num": "422"
                    },
                    {
                        "date": "01/02",
                        "num": "766"
                    },
                    {
                        "date": "01/03",
                        "num": "204"
                    }
                ],
                "name": "金龙洞"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "906"
                    },
                    {
                        "date": "12/29",
                        "num": "594"
                    },
                    {
                        "date": "12/30",
                        "num": "977"
                    },
                    {
                        "date": "12/31",
                        "num": "555"
                    },
                    {
                        "date": "01/01",
                        "num": "403"
                    },
                    {
                        "date": "01/02",
                        "num": "275"
                    },
                    {
                        "date": "01/03",
                        "num": "892"
                    }
                ],
                "name": "九牛洞村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "640"
                    },
                    {
                        "date": "12/29",
                        "num": "659"
                    },
                    {
                        "date": "12/30",
                        "num": "579"
                    },
                    {
                        "date": "12/31",
                        "num": "720"
                    },
                    {
                        "date": "01/01",
                        "num": "131"
                    },
                    {
                        "date": "01/02",
                        "num": "225"
                    },
                    {
                        "date": "01/03",
                        "num": "873"
                    }
                ],
                "name": "熹乐谷"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "295"
                    },
                    {
                        "date": "12/29",
                        "num": "879"
                    },
                    {
                        "date": "12/30",
                        "num": "874"
                    },
                    {
                        "date": "12/31",
                        "num": "557"
                    },
                    {
                        "date": "01/01",
                        "num": "108"
                    },
                    {
                        "date": "01/02",
                        "num": "622"
                    },
                    {
                        "date": "01/03",
                        "num": "819"
                    }
                ],
                "name": "田野绿世界"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "966"
                    },
                    {
                        "date": "12/29",
                        "num": "247"
                    },
                    {
                        "date": "12/30",
                        "num": "167"
                    },
                    {
                        "date": "12/31",
                        "num": "252"
                    },
                    {
                        "date": "01/01",
                        "num": "844"
                    },
                    {
                        "date": "01/02",
                        "num": "614"
                    },
                    {
                        "date": "01/03",
                        "num": "298"
                    }
                ],
                "name": "观音山王山寺"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "150"
                    },
                    {
                        "date": "12/29",
                        "num": "695"
                    },
                    {
                        "date": "12/30",
                        "num": "587"
                    },
                    {
                        "date": "12/31",
                        "num": "525"
                    },
                    {
                        "date": "01/01",
                        "num": "114"
                    },
                    {
                        "date": "01/02",
                        "num": "767"
                    },
                    {
                        "date": "01/03",
                        "num": "538"
                    }
                ],
                "name": "金龟泉生态度假村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "667"
                    },
                    {
                        "date": "12/29",
                        "num": "181"
                    },
                    {
                        "date": "12/30",
                        "num": "264"
                    },
                    {
                        "date": "12/31",
                        "num": "126"
                    },
                    {
                        "date": "01/01",
                        "num": "427"
                    },
                    {
                        "date": "01/02",
                        "num": "906"
                    },
                    {
                        "date": "01/03",
                        "num": "633"
                    }
                ],
                "name": "上岳古民居"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "111"
                    },
                    {
                        "date": "12/29",
                        "num": "220"
                    },
                    {
                        "date": "12/30",
                        "num": "795"
                    },
                    {
                        "date": "12/31",
                        "num": "128"
                    },
                    {
                        "date": "01/01",
                        "num": "109"
                    },
                    {
                        "date": "01/02",
                        "num": "987"
                    },
                    {
                        "date": "01/03",
                        "num": "391"
                    }
                ],
                "name": "峰林胜境景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "552"
                    },
                    {
                        "date": "12/29",
                        "num": "122"
                    },
                    {
                        "date": "12/30",
                        "num": "526"
                    },
                    {
                        "date": "12/31",
                        "num": "399"
                    },
                    {
                        "date": "01/01",
                        "num": "331"
                    },
                    {
                        "date": "01/02",
                        "num": "963"
                    },
                    {
                        "date": "01/03",
                        "num": "812"
                    }
                ],
                "name": "英德老虎谷暗河漂流"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "448"
                    },
                    {
                        "date": "12/29",
                        "num": "239"
                    },
                    {
                        "date": "12/30",
                        "num": "981"
                    },
                    {
                        "date": "12/31",
                        "num": "386"
                    },
                    {
                        "date": "01/01",
                        "num": "535"
                    },
                    {
                        "date": "01/02",
                        "num": "379"
                    },
                    {
                        "date": "01/03",
                        "num": "956"
                    }
                ],
                "name": "九龙小镇"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "169"
                    },
                    {
                        "date": "12/29",
                        "num": "638"
                    },
                    {
                        "date": "12/30",
                        "num": "792"
                    },
                    {
                        "date": "12/31",
                        "num": "831"
                    },
                    {
                        "date": "01/01",
                        "num": "279"
                    },
                    {
                        "date": "01/02",
                        "num": "665"
                    },
                    {
                        "date": "01/03",
                        "num": "608"
                    }
                ],
                "name": "铁溪小镇"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "859"
                    },
                    {
                        "date": "12/29",
                        "num": "136"
                    },
                    {
                        "date": "12/30",
                        "num": "971"
                    },
                    {
                        "date": "12/31",
                        "num": "458"
                    },
                    {
                        "date": "01/01",
                        "num": "128"
                    },
                    {
                        "date": "01/02",
                        "num": "238"
                    },
                    {
                        "date": "01/03",
                        "num": "936"
                    }
                ],
                "name": "仙湖温泉旅游度假区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "104"
                    },
                    {
                        "date": "12/29",
                        "num": "277"
                    },
                    {
                        "date": "12/30",
                        "num": "673"
                    },
                    {
                        "date": "12/31",
                        "num": "824"
                    },
                    {
                        "date": "01/01",
                        "num": "405"
                    },
                    {
                        "date": "01/02",
                        "num": "624"
                    },
                    {
                        "date": "01/03",
                        "num": "580"
                    }
                ],
                "name": "浈阳坊旅游小镇"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "489"
                    },
                    {
                        "date": "12/29",
                        "num": "157"
                    },
                    {
                        "date": "12/30",
                        "num": "124"
                    },
                    {
                        "date": "12/31",
                        "num": "514"
                    },
                    {
                        "date": "01/01",
                        "num": "837"
                    },
                    {
                        "date": "01/02",
                        "num": "767"
                    },
                    {
                        "date": "01/03",
                        "num": "120"
                    }
                ],
                "name": "大樟沙滩度假村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "864"
                    },
                    {
                        "date": "12/29",
                        "num": "318"
                    },
                    {
                        "date": "12/30",
                        "num": "590"
                    },
                    {
                        "date": "12/31",
                        "num": "144"
                    },
                    {
                        "date": "01/01",
                        "num": "691"
                    },
                    {
                        "date": "01/02",
                        "num": "287"
                    },
                    {
                        "date": "01/03",
                        "num": "183"
                    }
                ],
                "name": "云水谣"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "555"
                    },
                    {
                        "date": "12/29",
                        "num": "606"
                    },
                    {
                        "date": "12/30",
                        "num": "167"
                    },
                    {
                        "date": "12/31",
                        "num": "948"
                    },
                    {
                        "date": "01/01",
                        "num": "597"
                    },
                    {
                        "date": "01/02",
                        "num": "966"
                    },
                    {
                        "date": "01/03",
                        "num": "196"
                    }
                ],
                "name": "彭家祠"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "675"
                    },
                    {
                        "date": "12/29",
                        "num": "873"
                    },
                    {
                        "date": "12/30",
                        "num": "337"
                    },
                    {
                        "date": "12/31",
                        "num": "337"
                    },
                    {
                        "date": "01/01",
                        "num": "407"
                    },
                    {
                        "date": "01/02",
                        "num": "976"
                    },
                    {
                        "date": "01/03",
                        "num": "965"
                    }
                ],
                "name": "清远市连州福山景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "208"
                    },
                    {
                        "date": "12/29",
                        "num": "283"
                    },
                    {
                        "date": "12/30",
                        "num": "516"
                    },
                    {
                        "date": "12/31",
                        "num": "126"
                    },
                    {
                        "date": "01/01",
                        "num": "618"
                    },
                    {
                        "date": "01/02",
                        "num": "848"
                    },
                    {
                        "date": "01/03",
                        "num": "175"
                    }
                ],
                "name": "大东山温泉度假区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "961"
                    },
                    {
                        "date": "12/29",
                        "num": "100"
                    },
                    {
                        "date": "12/30",
                        "num": "138"
                    },
                    {
                        "date": "12/31",
                        "num": "980"
                    },
                    {
                        "date": "01/01",
                        "num": "283"
                    },
                    {
                        "date": "01/02",
                        "num": "626"
                    },
                    {
                        "date": "01/03",
                        "num": "135"
                    }
                ],
                "name": "李屋村"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "471"
                    },
                    {
                        "date": "12/29",
                        "num": "351"
                    },
                    {
                        "date": "12/30",
                        "num": "842"
                    },
                    {
                        "date": "12/31",
                        "num": "788"
                    },
                    {
                        "date": "01/01",
                        "num": "995"
                    },
                    {
                        "date": "01/02",
                        "num": "752"
                    },
                    {
                        "date": "01/03",
                        "num": "674"
                    }
                ],
                "name": "潭岭天湖"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "224"
                    },
                    {
                        "date": "12/29",
                        "num": "324"
                    },
                    {
                        "date": "12/30",
                        "num": "848"
                    },
                    {
                        "date": "12/31",
                        "num": "398"
                    },
                    {
                        "date": "01/01",
                        "num": "701"
                    },
                    {
                        "date": "01/02",
                        "num": "956"
                    },
                    {
                        "date": "01/03",
                        "num": "735"
                    }
                ],
                "name": "油岭瑶寨"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "189"
                    },
                    {
                        "date": "12/29",
                        "num": "705"
                    },
                    {
                        "date": "12/30",
                        "num": "173"
                    },
                    {
                        "date": "12/31",
                        "num": "649"
                    },
                    {
                        "date": "01/01",
                        "num": "393"
                    },
                    {
                        "date": "01/02",
                        "num": "154"
                    },
                    {
                        "date": "01/03",
                        "num": "724"
                    }
                ],
                "name": "瑶族舞曲实景演出"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "152"
                    },
                    {
                        "date": "12/29",
                        "num": "957"
                    },
                    {
                        "date": "12/30",
                        "num": "558"
                    },
                    {
                        "date": "12/31",
                        "num": "995"
                    },
                    {
                        "date": "01/01",
                        "num": "171"
                    },
                    {
                        "date": "01/02",
                        "num": "908"
                    },
                    {
                        "date": "01/03",
                        "num": "182"
                    }
                ],
                "name": "云海花谷"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "198"
                    },
                    {
                        "date": "12/29",
                        "num": "577"
                    },
                    {
                        "date": "12/30",
                        "num": "464"
                    },
                    {
                        "date": "12/31",
                        "num": "974"
                    },
                    {
                        "date": "01/01",
                        "num": "599"
                    },
                    {
                        "date": "01/02",
                        "num": "164"
                    },
                    {
                        "date": "01/03",
                        "num": "898"
                    }
                ],
                "name": "大旭山瀑布群旅游景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "538"
                    },
                    {
                        "date": "12/29",
                        "num": "794"
                    },
                    {
                        "date": "12/30",
                        "num": "450"
                    },
                    {
                        "date": "12/31",
                        "num": "722"
                    },
                    {
                        "date": "01/01",
                        "num": "696"
                    },
                    {
                        "date": "01/02",
                        "num": "700"
                    },
                    {
                        "date": "01/03",
                        "num": "957"
                    }
                ],
                "name": "皇后山"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "147"
                    },
                    {
                        "date": "12/29",
                        "num": "427"
                    },
                    {
                        "date": "12/30",
                        "num": "345"
                    },
                    {
                        "date": "12/31",
                        "num": "817"
                    },
                    {
                        "date": "01/01",
                        "num": "156"
                    },
                    {
                        "date": "01/02",
                        "num": "823"
                    },
                    {
                        "date": "01/03",
                        "num": "186"
                    }
                ],
                "name": "鹰扬关景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "853"
                    },
                    {
                        "date": "12/29",
                        "num": "539"
                    },
                    {
                        "date": "12/30",
                        "num": "467"
                    },
                    {
                        "date": "12/31",
                        "num": "858"
                    },
                    {
                        "date": "01/01",
                        "num": "201"
                    },
                    {
                        "date": "01/02",
                        "num": "593"
                    },
                    {
                        "date": "01/03",
                        "num": "207"
                    }
                ],
                "name": "雾山梯田"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "194"
                    },
                    {
                        "date": "12/29",
                        "num": "203"
                    },
                    {
                        "date": "12/30",
                        "num": "875"
                    },
                    {
                        "date": "12/31",
                        "num": "786"
                    },
                    {
                        "date": "01/01",
                        "num": "294"
                    },
                    {
                        "date": "01/02",
                        "num": "564"
                    },
                    {
                        "date": "01/03",
                        "num": "518"
                    }
                ],
                "name": "北山古寺"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "166"
                    },
                    {
                        "date": "12/29",
                        "num": "111"
                    },
                    {
                        "date": "12/30",
                        "num": "933"
                    },
                    {
                        "date": "12/31",
                        "num": "863"
                    },
                    {
                        "date": "01/01",
                        "num": "364"
                    },
                    {
                        "date": "01/02",
                        "num": "149"
                    },
                    {
                        "date": "01/03",
                        "num": "356"
                    }
                ],
                "name": "水口鱼水旅游风景区"
            },
            {
                "data": [
                    {
                        "date": "12/28",
                        "num": "593"
                    },
                    {
                        "date": "12/29",
                        "num": "119"
                    },
                    {
                        "date": "12/30",
                        "num": "275"
                    },
                    {
                        "date": "12/31",
                        "num": "297"
                    },
                    {
                        "date": "01/01",
                        "num": "271"
                    },
                    {
                        "date": "01/02",
                        "num": "978"
                    },
                    {
                        "date": "01/03",
                        "num": "294"
                    }
                ],
                "name": "龙凤温泉"
            }
        ],
          dateChose:[
                {context:'周',class:'chose'},
                {context:'月',class:''},
                {context:'年',class:''},
            ],
            // ['#FF8885','#57ABFE', '#368DF7', '#7E6AF6', '#E39A50','#FFCD38',  '#4EBBFC', '#75CF65','#B8E986', '#86E9E8', '#58E5E1','#4BCEDD']
            // scenics:['风林胜风景区','风林胜风景区','风林胜风景区','风林胜风景区','风林胜风景区','风林胜风景区','风林胜风景区',],
            // idName:['c4s1','c4s2','c4s3','c4s4','c4s5','c4s6','c4s7','c4s8','c4s9'],
      }
    },
    // props: {
    //     mainContent: {
    //         type: String,
    //         default: function () {
    //                 return 'D2S'
    //         }
    //     },
    // },
    components: {
        a1ss,
    },
    methods:{

    },
    mounted(){
        this.$emit('showDateFormatChose',this.dateChose)
    }
  }
</script>

